tickets/app/controllers/tickets_controller.rb

  def index
    @tickets = Ticket.all
---
SELECT * FROM "tickets"

  def show
    @ticket = Ticket.find(params[:id])
---
SELECT * FROM "tickets" WHERE ("tickets"."id" = 1)

  def create
    @ticket = Ticket.new(params[:ticket])

    respond_to do |format|
      if @ticket.save
---
INSERT INTO "tickets" ("name", "updated_at", "price", "seat_id", "phone", "address", "email", "created_at") VALUES('Damia Razale', '2009-07-27 02:04:00', 25.0, '11A', '03-88852469', 'Presint 11', 'damia@yahoo.com', '2009-07-27 02:04:00')